# CLI Basics
brew "broot"
brew "diff-so-fancy"
brew "duf"
brew "hyperfine"
brew "just"
brew "procs"
brew "sd"
brew "tealdeer"
brew "tokei"
brew "zoxide"
brew "cryptsetup"
brew "gnupg"
brew "lynis"
brew "btop"
brew "gping"

# CLI Development Suits
brew 'httpie'         # HTTP / API testing testing client
brew 'lazydocker'     # Full Docker management app
brew 'lazygit'        # Full Git management app

# Development Langs, Compilers, Package Managers and SDKs
brew 'gcc'            # GNU C++ compilers
brew 'lua'            # Lua interpreter
brew 'luarocks'       # Package manager for Lua
brew 'node'           # Node.js
brew 'nvm'            # Switching node versions
brew 'python'         # Python interpreter
brew 'rust'           # Rust language

# DevOps
brew 'ansible'        # Automation
brew 'docker'         # Containers

# Development Utils
brew 'gh'             # Interact with GitHub PRs, issues, repos
brew 'git-extras'     # Extra git commands for common tasks
brew 'tig'            # Text-mode interface for git
brew 'ttygif'         # Generate GIF from terminal commands + output
brew 'watchman'       # Watch for changes and reload dev server

# Network and Security Testing
brew 'bettercap'      # Network, scanning and monitoring
brew 'nmap'           # Port scanning
brew 'wrk'            # HTTP benchmarking

# EOF